isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
/* Send an FC(CTS, BS=0, STmin=0) to `dst`. FC frames always travel
 * with TYPE = DATA per the spec. */
static void send_fc_cts(uint8_t dst)
{
    uint8_t frame[3] = {
        (uint8_t)(BL_ISOTP_PCI_FC | BL_ISOTP_FC_CTS),
        BL_ISOTP_FC_BS_DEFAULT,
        BL_ISOTP_FC_STMIN_DEFAULT,
    };
    send_raw((uint8_t)BL_PROTO_TYPE_DATA, dst, frame, 3U);
}

/* ---- Opcode handlers ---- */

/* CMD_CONNECT: [major, minor]. Major must match exactly; minor is a
 * hint, carried for diagnostics but not validated. On success the
 * session latch goes high and the bootloader echoes back its own
 * (major, minor). */
static void handle_connect(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (args_len < 2U) {
        send_nack(peer, BL_CMD_CONNECT, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t host_major = args[0];
    /* args[1] is host_minor — unused today, reserved. */

    if (host_major != BL_PROTO_VERSION_MAJOR) {
        send_nack(peer, BL_CMD_CONNECT, BL_NACK_PROTOCOL_VERSION);
        return;
    }

    g_session_active = true;
    session_touch_activity();  /* arm the watchdog starting now */

    uint8_t resp[3] = {
        BL_CMD_CONNECT,
        BL_PROTO_VERSION_MAJOR,
        BL_PROTO_VERSION_MINOR,
    };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_DISCONNECT: no args. Clears the session latch and acks. */
static void handle_disconnect(uint8_t peer, uint16_t args_len)
{
    (void)args_len;
    g_session_active = false;
    uint8_t resp[1] = { BL_CMD_DISCONNECT };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_DISCOVER: no args. Reply as TYPE=DISCOVER with this node's ID
 * and the bootloader's protocol version. Richer identity (product
 * name, fw version, build stamp, …) is fetched via CMD_GET_FW_INFO
 * once a host has picked the node it wants to talk to. */
static void handle_discover(uint8_t peer)
{
    uint8_t resp[4] = {
        BL_CMD_DISCOVER,
        BL_NODE_ID,
        BL_PROTO_VERSION_MAJOR,
        BL_PROTO_VERSION_MINOR,
    };
    send_message(BL_PROTO_TYPE_DISCOVER, peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_GET_FW_INFO: no args. Returns the 64-byte __firmware_info record
 * the application publishes at BL_FWINFO_ADDR. The ACK is 65 bytes of
 * payload (1 opcode + 64 record bytes), so it goes out as an ISO-TP
 * First Frame plus nine Consecutive Frames — the first real exercise
 * of multi-frame TX.
 *
 * Errors:
 *   - BL_NACK_NO_VALID_APP   — no valid application is installed
 *   - BL_NACK_UNSUPPORTED    — app is present but has no firmware-info
 *                              record (missing / wrong magic / bad
 *                              record-version). Treated as a host-side
 *                              "this image pre-dates the convention". */
static void handle_get_fw_info(uint8_t peer)
{
    if (Bootloader_CheckApplication() != 0U) {
        send_nack(peer, BL_CMD_GET_FW_INFO, BL_NACK_NO_VALID_APP);
        return;
    }

    const bl_fwinfo_t *info = bl_fwinfo_get();
    if (info == (const bl_fwinfo_t *)0) {
        send_nack(peer, BL_CMD_GET_FW_INFO, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t resp[1U + BL_FWINFO_SIZE];
    resp[0] = BL_CMD_GET_FW_INFO;
    memcpy(&resp[1], info, BL_FWINFO_SIZE);
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_GET_HEALTH: no args. Returns the 32-byte health record built by
 * bl_health. Not session-gated — hosts should be able to poll health
 * at any time (e.g. while deciding whether to open a session). ACK
 * payload is 33 bytes (opcode + record) → one FF + four CFs. */
static void handle_get_health(uint8_t peer)
{
    bl_health_record_t record;
    bl_health_fill_record(&record);

    uint8_t resp[1U + BL_HEALTH_RECORD_SIZE];
    resp[0] = BL_CMD_GET_HEALTH;
    memcpy(&resp[1], &record, BL_HEALTH_RECORD_SIZE);
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_DTC_READ: no args. Returns the full DTC table as
 *   [opcode, count_le16, entry_0, entry_1, …]
 * Up to 32 entries × 20 bytes + 3 bytes of header = 643 bytes worst
 * case, well inside the 1024 B reassembly buffer. Not session-gated —
 * diagnostic reads should always be possible, even before CONNECT. */
static void handle_dtc_read(uint8_t peer)
{
    uint8_t resp[1U + 2U + BL_DTC_MAX_ENTRIES * sizeof(bl_dtc_entry_t)];
    resp[0] = BL_CMD_DTC_READ;

    uint16_t payload_len = 0U;
    bl_dtc_serialize(&resp[1], &payload_len);

    send_ack(peer, resp, (uint16_t)(1U + payload_len));
}

/* CMD_DTC_CLEAR: no args. Wipes the DTC table. Session-gated because
 * erasing fault history is destructive. */
static void handle_dtc_clear(uint8_t peer)
{
    if (!g_session_active) {
        send_nack(peer, BL_CMD_DTC_CLEAR, BL_NACK_BAD_SESSION);
        return;
    }
    bl_dtc_clear();

    uint8_t resp[1] = { BL_CMD_DTC_CLEAR };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_RESET: [mode]. Modes:
 *   0 = hard reset via NVIC_SystemReset
 *   1 = soft reset — same as 0 on this family, no distinction in HW
 *   2 = reset and re-enter the bootloader listen loop (RTC->BKP0R magic)
 *   3 = jump directly to the installed application (no reset)
 *
 * Mode 3 is validated before ACK: if the installed app fails
 * Bootloader_CheckApplication the host gets BL_NACK_NO_VALID_APP and
 * the bootloader stays in listen mode. Modes 0..2 always ACK and then
 * trigger the reset. */
static void handle_reset(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (args_len < 1U) {
        send_nack(peer, BL_CMD_RESET, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t mode = args[0];
    if (mode > 3U) {
        send_nack(peer, BL_CMD_RESET, BL_NACK_UNSUPPORTED);
        return;
    }

    if (mode == 3U && Bootloader_CheckApplication() != 0U) {
        send_nack(peer, BL_CMD_RESET, BL_NACK_NO_VALID_APP);
        return;
    }

    uint8_t resp[1] = { BL_CMD_RESET };
    send_ack(peer, resp, (uint16_t)sizeof(resp));

    /* Let the ACK drain onto the wire before we yank the MCU. */
    HAL_Delay(10U);

